/* vxbMmcStorage.c - MMC driver file for vxBus */

/*
 * Copyright (c) 2012 - 2016 Wind River Systems, Inc.
 *
 * The right to copy, distribute, modify or otherwise make use
 * of this software may be licensed only pursuant to the terms
 * of an applicable Wind River license agreement.
 */

/*
modification history
--------------------
13aug18,r_r  create, add eMMC support. Driver adapted from Windriver SD Card driver
*/

/*
DESCRIPTION
This module implements a driver for EMMC card. This driver checks the device name 
to probe driver. If success, the driver will identify this device and mounts the
device to xbd layer.

\ie
SEE ALSO: vxBus
*/

/* includes */

#include <vxWorks.h>
#include <stdio.h>
#include <ioLib.h>
#include <string.h>
#include <semLib.h>
#include <sysLib.h>
#include <taskLib.h>
#include <cacheLib.h>

#include <hwif/vxBus.h>
#include <subsys/timer/vxbTimerLib.h>

#include <vxbeMmcLib.h>
#include <emmcXbd.h>

#include <vxbeMmcStorage.h>

/* defines */

#ifdef __GNUC__
#define FUNCTION_NOT_USED __attribute__ ((unused))
#else
#define FUNCTION_NOT_USED
#endif /* __GNUC__ */

#ifdef  MMC_CARD_DBG_ON

#ifdef  LOCAL
#undef  LOCAL
#define LOCAL
#endif

#define MMC_CARD_DBG_INIT           0x00000001
#define MMC_CARD_DBG_RW             0x00000002
#define MMC_CARD_DBG_SET            0x00000004
#define MMC_CARD_DBG_ALL            0xffffffff
#define MMC_CARD_DBG_OFF            0x00000000

LOCAL UINT32 emmcCardDbgMask = MMC_CARD_DBG_OFF;

IMPORT FUNCPTR _func_logMsg;

#define MMC_CARD_DBG(mask, string, a, b, c, d, e, f)            \
    if ((emmcCardDbgMask & mask) || (mask == MMC_CARD_DBG_ALL))  \
        if (_func_logMsg != NULL)                               \
           (* _func_logMsg)(string, a, b, c, d, e, f)
#else
#   define MMC_CARD_DBG(mask, string, a, b, c, d, e, f)
#endif  /* MMC_DBG_ON */

typedef struct 
{
	 UINT32 LifeTimeEstA;
     UINT32 LifeTimeEstB;
     UINT32 PreEOLInfo;
 } EST_LIFE;
   
   EST_LIFE Dvr_EmmcEstLife;
   
typedef struct 
{
    UINT32 PartSupport;     // 160
	UINT32 MaxEnhSize2;     // 159
	UINT32 MaxEnhSize1;     // 158
	UINT32 MaxEnhSize0;     // 157
	UINT32 EnhAttrGPP;      // 156
	UINT32 ParSetComplete;  // 155
	UINT32 GPparSzMult42;   // 154
	UINT32 GPparSzMult41;   // 153
	UINT32 GPparSzMult40;   // 152
	UINT32 GPparSzMult32;   // 151
	UINT32 GPparSzMult31;   // 150
	UINT32 GPparSzMult30;   // 149
	UINT32 GPparSzMult22;   // 148
	UINT32 GPparSzMult21;   // 147
	UINT32 GPparSzMult20;   // 146
	UINT32 GPparSzMult12;   // 145
	UINT32 GPparSzMult11;   // 144
	UINT32 GPparSzMult10;   // 143
	UINT32 EnhSzMult2;      // 142
	UINT32 EnhSzMult1;      // 141
	UINT32 EnhSzMult0;      // 140
	UINT32 EnhStartAddr3;   // 139     
	UINT32 EnhStartAddr2;   // 138     
	UINT32 EnhStartAddr1;   // 137     
	UINT32 EnhStartAddr0;   // 136 
  } pSLC;
  
  pSLC Dvr_pSLC;
   
LOCAL STATUS emmcStorageBlkRead (void *, XBD_DATA *);
LOCAL STATUS emmcStorageBlkWrite (void *, XBD_DATA *);
LOCAL STATUS emmcStorageBlkRelWrite (void *, XBD_DATA * );
LOCAL STATUS emmcIdentify (VXB_DEV_HANDLE);
LOCAL STATUS emmcStatusWaitReadyForData(VXB_DEV_HANDLE);
LOCAL STATUS emmcStorageInstUnlink (VXB_DEV_HANDLE);
LOCAL int emmcStorageIoctl (void *, int, void *);
LOCAL STATUS emmcExtCsdDecode (VXB_DEV_HANDLE);
LOCAL STATUS emmcCacheFlush (VXB_DEV_HANDLE);
LOCAL STATUS emmcErase (VXB_DEV_HANDLE, SECTOR_RANGE *);
#ifdef NEED_TO_COMPILE
LOCAL STATUS emmcExtCsdSetPowClass (VXB_DEV_HANDLE) FUNCTION_NOT_USED;
LOCAL STATUS emmcCacheEn (VXB_DEV_HANDLE, UINT8) FUNCTION_NOT_USED;
LOCAL STATUS emmcSecErase (VXB_DEV_HANDLE, SECTOR_RANGE *) FUNCTION_NOT_USED;
LOCAL STATUS emmcHpiInterrput (VXB_DEV_HANDLE) FUNCTION_NOT_USED;
#endif
LOCAL STATUS emmcCardIdxAlloc (MMC_CARD_CTRL *);
LOCAL void emmcCardIdxFree (MMC_CARD_CTRL *);

